#### Create Method (HermiteSpline)

---

|  |
| --- |
| NurbSpline Class   See Also |

Creates a new geometric NurbSpline object from a HermiteSpline.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)
  **Since:**  2017

# Syntax

| C# |
| --- |
| ``` public static NurbSpline Create( 	HermiteSpline hermiteSpline ) ``` |

| Visual Basic |
| --- |
| ``` Public Shared Function Create ( _ 	hermiteSpline As HermiteSpline _ ) As NurbSpline ``` |

| Visual C++ |
| --- |
| ``` public: static NurbSpline^ Create( 	HermiteSpline^ hermiteSpline ) ``` |

#### Parameters

hermiteSpline
:   Type:  Autodesk.Revit.DB HermiteSpline
     The hermite spline that will be converted to NurbSpline.

#### Return Value

The new NurbSpline object.

# See Also

NurbSpline Class

Autodesk.Revit.DB Namespace